{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import re\n",
    "import yaml"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def compilePath(child, parentPath=''):\n",
    "    \"\"\"\n",
    "    Generates the query paths for a given child and all its children\n",
    "\n",
    "    >>> child = {\"id\": \"work\", \"type\": \"crm:E36_Visual_Item\", \"query\": \"$subject crm:P128_carries ?value .\", \"children\": [{\"id\": \"work_creation\", \"query\": \"$subject crm:P94i_was_created_by ?value .\", \"children\" : [{\"id\": \"work_creator\", \"query\" : \"$subject crm:P14_carried_out_by ?value .\" }] }] }\n",
    "    >>> print(compilePath(child, \"\"))\n",
    "    $subject crm:P128_carries ?value_work .\n",
    "    $subject crm:P128_carries/crm:P94i_was_created_by ?value_work_creation .\n",
    "    $subject crm:P128_carries/crm:P94i_was_created_by/crm:P14_carried_out_by ?value_work_creator .\n",
    "    \"\"\"\n",
    "    query = child['query']\n",
    "    optional = child['optional'] if 'optional' in child else False\n",
    "    \n",
    "    subjectPathPattern = r'(?:\\$subject\\s)([^\\s]*)'\n",
    "    subjectPath = re.search(subjectPathPattern, query).group(1)\n",
    "    \n",
    "    completePath = parentPath + '/' + subjectPath if parentPath else subjectPath\n",
    "\n",
    "    query = query.replace(subjectPath, completePath)\n",
    "    \n",
    "    # Namespace variables by prefixing them with (unique) field id\n",
    "    query = re.sub(r'\\?([^\\s/,:,\\-\\\\\\(\\)]*)', r'?\\1_' + child['id'], query)\n",
    "    \n",
    "    if optional:\n",
    "        query = \"OPTIONAL { %s }\\n\" % query\n",
    "    \n",
    "    if 'children' in child:\n",
    "        for c in child['children']:\n",
    "            query = query + \"\\n\" + compilePath(c, completePath)\n",
    "    \n",
    "    return query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT * WHERE {\n",
      "$subject a crm:E22_Man-Made_Object\n",
      "OPTIONAL {  $subject crm:P2_has_type ?value_artwork_genre . ?value_artwork_genre crm:P2_has_type sari:genre ; rdfs:label ?label_artwork_genre .  }\n",
      "OPTIONAL {  $subject crm:P2_has_type ?value_artwork_medium . ?value_artwork_medium crm:P2_has_type sari:medium ; rdfs:label ?label_artwork_medium .  }\n",
      " $subject crm:P128_carries ?value_work . \n",
      " $subject crm:P128_carries/crm:P94i_was_created_by ?value_work_creation . \n",
      "OPTIONAL {  $subject crm:P128_carries/crm:P94i_was_created_by/crm:P14_carried_out_by ?value_work_creator .  }\n",
      "\n",
      "OPTIONAL {  $subject crm:P128_carries/crm:P94i_was_created_by/crm:P9_consists_of ?subcreation_work_creator_with_role . ?subcreation_work_creator_with_role crm:P2_has_type ?subcreation_type_work_creator_with_role ; crm:P14_carried_out_by ?subcreation_person_work_creator_with_role . ?subcreation_type_work_creator_with_role rdfs:label ?subcreation_type_label_work_creator_with_role . ?subcreation_person_work_creator_with_role rdfs:label ?subcreation_person_label_work_creator_with_role . BIND(CONCAT(?subcreation_person_label_work_creator_with_role, \" (\" , ?subcreation_type_label_work_creator_with_role, \")\") as ?value_work_creator_with_role)  }\n",
      "\n",
      "OPTIONAL {  $subject crm:P128_carries/crm:P138_represents ?value_represented_actor . ?value_represented_actor a crm:E39_Actor .  }\n",
      "\n",
      "OPTIONAL {  $subject crm:P128_carries/crm:P138_represents ?value_represented_event . ?value_represented_event a crm:E5_Event .  }\n",
      "\n",
      "OPTIONAL {  $subject crm:P128_carries/crm:P138_represents ?value_represented_group . ?value_represented_group a crm:E74_Group .  }\n",
      "\n",
      "OPTIONAL {  $subject crm:P128_carries/crm:P138_represents ?value_represented_place . ?value_represented_place a crm:E53_Place .  }\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "def compileQuery(node):\n",
    "    \"\"\"\n",
    "    >>> node = {\"id\": \"artwork\", \"label\": \"Artwork\", \"type\": \"crm:E22_Human-Made_Object\", \"children\": [{\"id\": \"work\", \"type\": \"crm:E36_Visual_Item\", \"query\": \"$subject crm:P128_carries ?value .\", \"children\": [{\"id\": \"work_creation\", \"query\": \"$subject crm:P94i_was_created_by ?value .\", \"children\" : [{\"id\": \"work_creator\", \"optional\": True, \"query\" : \"$subject crm:P14_carried_out_by ?value .\" }] }] }]}\n",
    "    >>> print(compileQuery(node))\n",
    "    SELECT * WHERE {\n",
    "    $subject a crm:E22_Human-Made_Object\n",
    "    $subject crm:P128_carries ?value_work .\n",
    "    $subject crm:P128_carries/crm:P94i_was_created_by ?value_work_creation .\n",
    "    OPTIONAL { $subject crm:P128_carries/crm:P94i_was_created_by/crm:P14_carried_out_by ?value_work_creator . }\n",
    "    }\n",
    "    \"\"\"\n",
    "    query = \"SELECT * WHERE {\\n\"\n",
    "    query = query + \"$subject a \" + node['type'] + \"\\n\"\n",
    "    for child in node['children']:\n",
    "        query = query + compilePath(child)\n",
    "        \n",
    "    query = query+\"}\"\n",
    "    return query\n",
    "\n",
    "print(compileQuery(model[0]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<generator object dict_generator at 0x7ff0f8340138>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "def parseModelFromFile(inputFile):\n",
    "    \"\"\"\n",
    "    Reads input model from filepath\n",
    "\n",
    "    >>> model = parseModelFromFile('../models/bso.yml')\n",
    "    >>> print(type(model))\n",
    "    <class 'list'>\n",
    "    \"\"\"\n",
    "    with open(inputFile, 'r') as f:\n",
    "        modelData = yaml.safe_load(f.read())\n",
    "    return modelData\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "inputFile = '../models/bso.yml'\n",
    "model = parseModelFromFile(inputFile)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'SELECT * WHERE {\\n$subject a crm:E22_Man-Made_Object\\nOPTIONAL {  $subject crm:P2_has_type ?value_artwork_genre . ?value_artwork_genre crm:P2_has_type sari:genre ; rdfs:label ?label_artwork_genre .  }\\nOPTIONAL {  $subject crm:P2_has_type ?value_artwork_medium . ?value_artwork_medium crm:P2_has_type sari:medium ; rdfs:label ?label_artwork_medium .  }\\n $subject crm:P128_carries ?value_work . \\n $subject crm:P128_carries/crm:P94i_was_created_by ?value_work_creation . \\nOPTIONAL {  $subject crm:P128_carries/crm:P94i_was_created_by/crm:P14_carried_out_by ?value_work_creator .  }\\n\\nOPTIONAL {  $subject crm:P128_carries/crm:P94i_was_created_by/crm:P9_consists_of ?subcreation_work_creator_with_role . ?subcreation_work_creator_with_role crm:P2_has_type ?subcreation_type_work_creator_with_role ; crm:P14_carried_out_by ?subcreation_person_work_creator_with_role . ?subcreation_type_work_creator_with_role rdfs:label ?subcreation_type_label_work_creator_with_role . ?subcreation_person_work_creator_with_role rdfs:label ?subcreation_person_label_work_creator_with_role . BIND(CONCAT(?subcreation_person_label_work_creator_with_role, \" (\" , ?subcreation_type_label_work_creator_with_role, \")\") as ?value_work_creator_with_role)  }\\n\\nOPTIONAL {  $subject crm:P128_carries/crm:P138_represents ?value_represented_actor . ?value_represented_actor a crm:E39_Actor .  }\\n\\nOPTIONAL {  $subject crm:P128_carries/crm:P138_represents ?value_represented_event . ?value_represented_event a crm:E5_Event .  }\\n\\nOPTIONAL {  $subject crm:P128_carries/crm:P138_represents ?value_represented_group . ?value_represented_group a crm:E74_Group .  }\\n\\nOPTIONAL {  $subject crm:P128_carries/crm:P138_represents ?value_represented_place . ?value_represented_place a crm:E53_Place .  }\\n}'"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
